#pragma once

// used: schema field
#include "schema.h"
#include "Handle.h"

using GameTime_t = std::float_t;
using GameTick_t = std::int32_t;

#define TICK_INTERVAL 0.015625f
#define TIME_TO_TICKS(TIME) (static_cast<int>(0.5f + static_cast<float>(TIME) / TICK_INTERVAL))
#define TICKS_TO_TIME(TICKS) (TICK_INTERVAL * static_cast<float>(TICKS))
#define ROUND_TO_TICKS(TIME) (TICK_INTERVAL * TIME_TO_TICKS(TIME))
#define TICK_NEVER_THINK (-1)

class CEntityInstance;

class CUserCMD;

class CPlayer_MovementServices
{
public:
	SCHEMA_ADD_FIELD(int32_t, m_nImpulse, "CPlayer_MovementServices->m_nImpulse");
	SCHEMA_ADD_FIELD(uint64_t, m_nQueuedButtonDownMask, "CPlayer_MovementServices->m_nQueuedButtonDownMask");
	SCHEMA_ADD_FIELD(uint64_t, m_nQueuedButtonChangeMask, "CPlayer_MovementServices->m_nQueuedButtonChangeMask");
	SCHEMA_ADD_FIELD(uint64_t, m_nButtonDoublePressed, "CPlayer_MovementServices->m_nButtonDoublePressed");
	SCHEMA_ADD_FIELD(uint32_t[64], m_pButtonPressedCmdNumber, "CPlayer_MovementServices->m_pButtonPressedCmdNumber");
	SCHEMA_ADD_FIELD(uint32_t, m_nLastCommandNumberProcessed, "CPlayer_MovementServices->m_nLastCommandNumberProcessed");
	SCHEMA_ADD_FIELD(uint64_t, m_nToggleButtonDownMask, "CPlayer_MovementServices->m_nToggleButtonDownMask");
	SCHEMA_ADD_FIELD(float, m_flMaxspeed, "CPlayer_MovementServices->m_flMaxspeed");
	SCHEMA_ADD_FIELD(float[4], m_arrForceSubtickMoveWhen, "CPlayer_MovementServices->m_arrForceSubtickMoveWhen");
	SCHEMA_ADD_FIELD(float, m_flForwardMove, "CPlayer_MovementServices->m_flForwardMove");
	SCHEMA_ADD_FIELD(float, m_flLeftMove, "CPlayer_MovementServices->m_flLeftMove");
	SCHEMA_ADD_FIELD(float, m_flUpMove, "CPlayer_MovementServices->m_flUpMove");
	SCHEMA_ADD_FIELD(Vector, m_vecLastMovementImpulses, "CPlayer_MovementServices->m_vecLastMovementImpulses");
};

class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:
	SCHEMA_ADD_FIELD(bool, m_bDucking, "CPlayer_MovementServices_Humanoid->m_bDucking");
	SCHEMA_ADD_FIELD(bool, m_bDucked, "CPlayer_MovementServices_Humanoid->m_bDucked");

	SCHEMA_ADD_FIELD(float_t, m_flSurfaceFriction, "CPlayer_MovementServices_Humanoid->m_flSurfaceFriction");
};

class CCSPlayer_MovementServices : public CPlayer_MovementServices_Humanoid
{
public:
	void ParachuteAccelerate(Vector& vecOutVelocity, float& flStamina, float& flFriction, Vector vecMove, float flFrameTime);

public:
	SCHEMA_ADD_FIELD(float_t, m_flDuckAmount, "CCSPlayer_MovementServices->m_flDuckAmount");
	SCHEMA_ADD_FIELD(float_t, m_flStamina, "CCSPlayer_MovementServices->m_flStamina");
};

class C_CSGameRules
{
public:
	SCHEMA_ADD_FIELD(bool, m_bFreezePeriod, "C_CSGameRules->m_bFreezePeriod");
	SCHEMA_ADD_FIELD(bool, m_bWarmupPeriod, "C_CSGameRules->m_bWarmupPeriod");
	SCHEMA_ADD_FIELD(bool, m_bTeamIntroPeriod, "C_CSGameRules->m_bTeamIntroPeriod");
	SCHEMA_ADD_FIELD(bool, m_bCTTimeOutActive, "C_CSGameRules->m_bCTTimeOutActive");
	SCHEMA_ADD_FIELD(bool, m_bTerroristTimeOutActive, "C_CSGameRules->m_bTerroristTimeOutActive");
	SCHEMA_ADD_FIELD(float, m_flTerroristTimeOutRemaining, "C_CSGameRules->m_flTerroristTimeOutRemaining");
	SCHEMA_ADD_FIELD(float, m_flCTTimeOutRemaining, "C_CSGameRules->m_flCTTimeOutRemaining");
	SCHEMA_ADD_FIELD(int, m_nTerroristTimeOuts, "C_CSGameRules->m_nTerroristTimeOuts");
	SCHEMA_ADD_FIELD(int, m_nCTTimeOuts, "C_CSGameRules->m_nCTTimeOuts");
	SCHEMA_ADD_FIELD(bool, m_bIsValveDS, "C_CSGameRules->m_bIsValveDS");
	SCHEMA_ADD_FIELD(bool, m_bHasMatchStarted, "C_CSGameRules->m_bHasMatchStarted");
	SCHEMA_ADD_FIELD(bool, m_bServerPaused, "C_CSGameRules->m_bServerPaused");
	SCHEMA_ADD_FIELD(bool, m_bBombPlanted, "C_CSGameRules->m_bBombPlanted");
	SCHEMA_ADD_FIELD(float, m_fRoundStartTime, "C_CSGameRules->m_fRoundStartTime");
	SCHEMA_ADD_FIELD(int, m_iRoundTime, "C_CSGameRules->m_iRoundTime");
	SCHEMA_ADD_FIELD(int, m_totalRoundsPlayed, "C_CSGameRules->m_totalRoundsPlayed");
	SCHEMA_ADD_FIELD(float, m_timeUntilNextPhaseStarts, "C_CSGameRules->m_timeUntilNextPhaseStarts");

	int GetFreezeTimeLeft();
	int GetRoundTimeLeft();
	int GetRound();
};

class IGlobalVars
{
public:
	float m_flRealTime; //0x0000
	int32_t m_nFrameCount; //0x0004
	float m_flFrameTime; //0x0008
	float m_flFrameTime2; //0x000C
	int32_t m_nMaxClients; //0x0010
	MEM_PAD(0x1C);
	float m_flIntervalPerSubTick; //0x0030
	float m_flCurrentTime; //0x0034
	float m_flCurrentTime2; //0x0038
	MEM_PAD(0xC);
	int32_t m_nTickCount; //0x0048
	MEM_PAD(0x8);
	int m_nSomeInt;
};

class CEntityIdentity
{
public:
	CS_CLASS_NO_INITIALIZER(CEntityIdentity);

	// @note: handle index is not entity index
	[[nodiscard]] inline std::add_lvalue_reference_t<std::uint32_t> GetIndex() {
		static const std::uint32_t uOffset = 0x10;
		return *reinterpret_cast<std::add_pointer_t<std::uint32_t>>(reinterpret_cast<std::uint8_t*>(this) + (uOffset));
	};
	SCHEMA_ADD_FIELD(const char*, m_designerName, "CEntityIdentity->m_designerName");
	SCHEMA_ADD_FIELD(std::uint32_t, m_flags, "CEntityIdentity->m_flags");

	[[nodiscard]] bool IsValid()
	{
		return GetIndex() != INVALID_EHANDLE_INDEX;
	}

	[[nodiscard]] int GetEntryIndex()
	{
		if (!IsValid())
			return ENT_ENTRY_MASK;

		return GetIndex() & ENT_ENTRY_MASK;
	}

	[[nodiscard]] int GetSerialNumber()
	{
		return GetIndex() >> NUM_SERIAL_NUM_SHIFT_BITS;
	}

	CEntityInstance* pInstance; // 0x00
};

class CEntityInstance
{
public:
	CS_CLASS_NO_INITIALIZER(CEntityInstance);

	void GetSchemaClassInfo(SchemaClassInfoData_t** pReturn)
	{
		return MEM::CallVFunc<void, 38U>(this, pReturn);
	}

	[[nodiscard]] CBaseHandle m_hEntityHandle()
	{
		CEntityIdentity* pIdentity = m_pEntity();
		if (pIdentity == nullptr)
			return CBaseHandle();

		return CBaseHandle(pIdentity->GetEntryIndex(), pIdentity->GetSerialNumber() - (pIdentity->m_flags() & 1));
	}

	SCHEMA_ADD_FIELD(CEntityIdentity*, m_pEntity, "CEntityInstance->m_pEntity");
};

class CCollisionProperty
{
public:
	CS_CLASS_NO_INITIALIZER(CCollisionProperty);

	SCHEMA_ADD_FIELD(Vector, m_vecMins, "CCollisionProperty->m_vecMins");
	SCHEMA_ADD_FIELD(Vector, m_vecMaxs, "CCollisionProperty->m_vecMaxs");

	std::uint16_t CollisionMask() {
		return *reinterpret_cast<std::uint16_t*>((uintptr_t)(this) + 0x38); // TODO: is this in schema?
	}
};

class CModel // TODO: remove fully, unused
{
private:
	MEM_PAD(0x70);                    // 0x0000
	int32_t m_iRendermeshCount;        // 0x0070
	MEM_PAD(0x4);                    // 0x0074
	void* m_pRenderMeshes;    // 0x0078
};

using CUtlSymLargeId = int*;

class CUtlSymbolLarge
{
	inline static const CUtlSymLargeId UTL_INVALID_SYMBOL_LARGE = reinterpret_cast<CUtlSymLargeId>(-1);

public:
	CUtlSymbolLarge() { id_ = UTL_INVALID_SYMBOL_LARGE; }

	explicit CUtlSymbolLarge(CUtlSymLargeId id) { id_ = id; }

	CUtlSymbolLarge(CUtlSymbolLarge const& sym) { id_ = sym.id_; }

	CUtlSymbolLarge& operator=(CUtlSymbolLarge const& src)
	{
		id_ = src.id_;

		return *this;
	}

	bool operator==(CUtlSymbolLarge const& src) const { return id_ == src.id_; }

	bool operator==(CUtlSymLargeId const& src) const { return id_ == src; }

	bool operator!=(CUtlSymbolLarge const& src) const { return id_ != src.id_; }

	bool operator!=(CUtlSymLargeId const& src) const { return id_ != src; }

	explicit operator CUtlSymLargeId() const { return id_; }

	[[nodiscard]] const char* String() const
	{
		if (id_ == UTL_INVALID_SYMBOL_LARGE)
			return "";

		return string_;
	}

	[[nodiscard]] bool IsValid() const
	{
		return id_ != UTL_INVALID_SYMBOL_LARGE;
	}

private:
	union
	{
		CUtlSymLargeId id_;
		const char* string_ = "";
	};
};

class CModelState
{
public:
	std::uint8_t padding_0[0x80];
	void* bones;
	std::uint8_t padding_1[0x18];
	CModel* modelHandle; // I think its just 8 bytes of pointer no? Well, im too lazy to look, we dont use this class anyway, too bad!
	CUtlSymbolLarge modelName;
};

class CSkeletonInstance
{
public:
	MEM_PAD(0x1CC); //0x0000
	int m_nBones; //0x01BC 
	MEM_PAD(0x18); //0x01C0
	int m_nMask; //0x01D8 
	MEM_PAD(0x4); //0x01DC
	void* m_pBoneCache;//0x1E0

	SCHEMA_ADD_FIELD(CModelState, m_modelState, "CSkeletonInstance->m_modelState");
};
class CGameSceneNode {
public:
	CS_CLASS_NO_INITIALIZER(CGameSceneNode);

	SCHEMA_ADD_FIELD(CEntityInstance*, m_pOwner, "CGameSceneNode->m_pOwner");
	SCHEMA_ADD_FIELD(CGameSceneNode*, m_pParent, "CGameSceneNode->m_pParent");
	SCHEMA_ADD_FIELD(CGameSceneNode*, m_pChild, "CGameSceneNode->m_pChild");
	SCHEMA_ADD_FIELD(CGameSceneNode*, m_pNextSibling, "CGameSceneNode->m_pNextSibling");
	SCHEMA_ADD_FIELD(CBaseHandle, m_hParent, "CGameSceneNode->m_hParent");
	SCHEMA_ADD_FIELD(Vector, m_vecOrigin, "CGameSceneNode->m_vecOrigin");
	SCHEMA_ADD_FIELD(QAngle, m_angRotation, "CGameSceneNode->m_angRotation");
	SCHEMA_ADD_FIELD(float, m_flScale, "CGameSceneNode->m_flScale");
	SCHEMA_ADD_FIELD(Vector, m_vecAbsOrigin, "CGameSceneNode->m_vecAbsOrigin");
	SCHEMA_ADD_FIELD(QAngle, m_angAbsRotation, "CGameSceneNode->m_angAbsRotation");
